[
    {
        "season": "1",
        "episode": "1",
        "title": "Enter: Naruto Uzumaki!",
        "air_date": "Sat, Sep 10, 2005",
        "description": "Welcome to Konoha, where deadly ninja roam the land and the mischievous Naruto Uzumaki causes trouble everywhere he goes. But when he steals the ancient scroll of sealing, he unleashes a rare power rarely seen in a 12-year-old boy.",
        "rating": "7.9",
        "votes": "2.7K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "2",
        "title": "My Name is Konohamaru!",
        "air_date": "Sat, Sep 10, 2005",
        "description": "Naruto finally graduates from the Ninja Academy and claims to know it all. Well, at least that's what he tells Konohamaru, Konoha's Hokage grandson.",
        "rating": "7.0",
        "votes": "1.9K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "3",
        "title": "Sasuke and Sakura: Friends or Foes?",
        "air_date": "Sat, Sep 17, 2005",
        "description": "On the way to becoming a ninja, Naruto must team up with his classmates, the pretty Sakura and the pretty serious Sasuke, whose common bond is that they both hate Naruto. So Naruto will try a different approach.",
        "rating": "7.2",
        "votes": "1.7K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "4",
        "title": "Pass or Fail: Survival Test",
        "air_date": "Sat, Sep 24, 2005",
        "description": "The recently formed Team 7 (Naruto, Sakura and Sasuke) meet their instructor, Hatake Kakashi, and begin training to see if they pass to the next stage of ninja training. Kakashi tells them to engage in the following exercise: try and take two bells away from him using their ninja knowledge.",
        "rating": "7.8",
        "votes": "1.7K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "5",
        "title": "You Failed! Kakashi's Final Decision",
        "air_date": "Sat, Oct 1, 2005",
        "description": "With the threat of failure hanging over their heads, Naruto, Sasuke and Sakura try everything they know to pass the grueling survival test. But it will take some wise advice from Kakashi to teach these selfish ninja a thing or two about teamwork.",
        "rating": "8.0",
        "votes": "1.7K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "6",
        "title": "A Dangerous Mission! Journey to the Land of Waves!",
        "air_date": "Sat, Oct 8, 2005",
        "description": "Naruto and his squad start their first ninja missions with boring and menial tasks. Weary and angry, Naruto vents his frustration at the Hokage. Amused by Naruto's excitement, he gives them a new mission, to protect a grumpy old man named Tazuna as he returns to his home!",
        "rating": "7.3",
        "votes": "1.6K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "7",
        "title": "The Assassin of the Mist!",
        "air_date": "Sat, Oct 15, 2005",
        "description": "Naruto and his squad arrive in the Land of the Waves and learn that an evil businessman named Gato has taken over the land. Zabuza Momochi appears, hired by Gato to kill Tazuna. Excited and ready to attack, Naruto can't wait to take on this powerful ninja assassin. Will he be up to the challenge?!",
        "rating": "7.7",
        "votes": "1.6K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "8",
        "title": "The Oath of Pain",
        "air_date": "Sat, Oct 22, 2005",
        "description": "Kakashi has the upper hand in his battle with Zabuza. But the tide turns when Kakashi is trapped inside Zabuza's Water Prison! Kakashi urges the squad to flee, but Naruto remembers the pledge he made--to never run away again--and holds his ground!!",
        "rating": "8.0",
        "votes": "1.6K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "9",
        "title": "Kakashi: Sharingan Warrior",
        "air_date": "Thu, Nov 28, 2002",
        "description": "Thanks to Naruto's ingenious plan, Kakashi is freed from the water prison. Kakashi is ready to use his Sharingan against Zabuza.",
        "rating": "7.9",
        "votes": "1.6K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "10",
        "title": "The Forest of Chakra",
        "air_date": "Thu, Dec 5, 2002",
        "description": "Recuperating at Tazuna's house, Kakashi is dissatisfied with the outcome of the battle. He concludes that Zabuza isn't dead and the young tracking ninja helped Zabuza escape! Kakashi decides to implement some interesting training that will allow Naruto, Sasuke and Sakura to better control their chakra!",
        "rating": "7.1",
        "votes": "1.4K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "11",
        "title": "The Land Where a Hero Once Lived",
        "air_date": "Thu, Dec 12, 2002",
        "description": "Sakura goes into town with Tazuna and sees the hardships that the people of the Land of Waves suffer under Gato's rule. This is the reason Tazuna is risking his life to build a bridge that crosses the ocean. With a bridge that gives everyone access to other lands, people will no longer have to rely on Gato, who controls all imports. Meanwhile, Naruto and Sasuke continue to train, using chakra to climb a tree.",
        "rating": "7.1",
        "votes": "1.4K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "12",
        "title": "Battle on the Bridge! Zabuza Returns!!",
        "air_date": "Thu, Dec 19, 2002",
        "description": "While Naruto concentrates on the training to control his chakra, a mysterious person suddenly appears before him. The person tells Naruto that as long as one has the desire to protect what he loves, there is no limit to becoming stronger. The mysterious figure echoes the sentiment inside Naruto and the two feel a sense of connection.",
        "rating": "7.3",
        "votes": "1.4K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "13",
        "title": "Haku's Secret Jutsu: Crystal Ice Mirrors",
        "air_date": "Thu, Dec 26, 2002",
        "description": "Once again, the time has come to fight Zabuza, and this time he's got company -- the tracking ninja who supposedly killed him. Zabuza and his companion take notice of Sasuke's abilities, and Sasuke in turn realizes the immense power that the masked ninja holds. As if they were meant to fight each other, Sasuke and the masked ninja begin to battle.",
        "rating": "7.7",
        "votes": "1.4K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "14",
        "title": "The Number One Hyperactive, Knucklehead Ninja Joins the Fight!!",
        "air_date": "Thu, Jan 9, 2003",
        "description": "Sasuke finds himself in a pinch inside of Haku's Crystal Ice Mirrors, but Naruto comes to the rescue. But Sasuke has a plan to counter Haku's jutsu with attacks from both the inside and outside the Crystal Ice Mirrors, and Naruto's unexpected action ruins Sasuke's strategy. Eventually, both young ninja are trapped.",
        "rating": "7.1",
        "votes": "1.4K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "15",
        "title": "Zero Visibility: The Sharingan Shatters",
        "air_date": "Thu, Jan 16, 2003",
        "description": "Realizing time is of the essence, Kakashi decides to use the Sharingan once again to defeat Zabuza.",
        "rating": "7.6",
        "votes": "1.4K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "16",
        "title": "The Broken Seal",
        "air_date": "Thu, Jan 23, 2003",
        "description": "Naruto and Sasuke continue to receive punishing attacks from within Haku's Crystal Ice Mirrors. Naruto can no longer stand on his feet. But during the intense battle, Sasuke starts to realize the power of his own Sharingan and gradually starts to elude Haku's assault. Haku decides to finish them off immediately. Sasuke is caught off guard by Haku's action and uses his own body to shield Naruto...",
        "rating": "8.3",
        "votes": "1.5K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "17",
        "title": "White Past: Hidden Ambition",
        "air_date": "Thu, Jan 30, 2003",
        "description": "Naruto finally explodes. His anger against Haku, who defeated Sasuke, unleashes the power of the Kyûbi. Naruto's chakra becomes so intense that even Kakashi and Zabuza, fighting in the distance, take notice. Haku is unable to do anything in the face of Naruto's hidden power.",
        "rating": "8.1",
        "votes": "1.5K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "18",
        "title": "The Weapons Known as Shinobi",
        "air_date": "Thu, Feb 6, 2003",
        "description": "Haku tells the hesitant Naruto to finish him off. Naruto strongly questions Haku's philosophy of existing only to fight and win. Meanwhile, the battle between Kakashi and Zabuza approaches its climax. Zabuza's movement is restrained by Kakashi's Summoning Jutsu. With victory within his grasp, Kakashi unleashes his most devastating maneuver.",
        "rating": "8.0",
        "votes": "1.4K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "19",
        "title": "The Demon in the Snow",
        "air_date": "Thu, Feb 13, 2003",
        "description": "Zabuza is no longer Kakashi's enemy, and thanks to a little speech by Naruto about how ninja are, Zabuza takes on Gato's men single handily. The Demon of the Hidden Mist takes his vengeance on Gato and all of those dumb enough to follow him, and apologizes to Haku for what he did to the kind little boy. After the group takes care of the rest of Gato's men, Zabuza asks Kakashi one final request, to see Haku one final time. This is Zabuza's requiem.",
        "rating": "9.0",
        "votes": "2.5K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "20",
        "title": "A New Chapter Begins: The Chunin Exam!",
        "air_date": "Thu, Feb 20, 2003",
        "description": "With their latest mission complete, it's time once again for the group to go back to mediocre missions. After all are done, Konohamaru and his friends pay a visit to Naruto. All which result in being chased by Sakura. Everyone is soon over though, as two mysterious ninja block their way, and one of them isn't too happy with Konohamaru. Sasuke arrives to save the day, but the leader of the group shows up, with stealth skills that surprise even Sasuke. Meanwhile, the Third Hokage announces that it's time once again for the Chuunin selection exams.",
        "rating": "7.0",
        "votes": "1.3K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "21",
        "title": "Identify Yourself: Powerful New Rivals",
        "air_date": "Thu, Feb 27, 2003",
        "description": "After the three ninjas take their leave, Sasuke realizes he has a powerful rival out there. The next day, Kakashi announces that he has recommended all of them for the Chuunin Exams. While Naruto and Sasuke are pleased, Sakura is afraid of letting everyone down. Also, someone decides they aren't ready and decides to test their abilities.",
        "rating": "7.2",
        "votes": "1.2K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "22",
        "title": "Chunin Challenge: Rock Lee vs. Sasuke!",
        "air_date": "Thu, Mar 6, 2003",
        "description": "The eccentric Rock Lee challenges Uchiha Sasuke to a battle before the Chuunin Exam begins.",
        "rating": "7.5",
        "votes": "1.3K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "23",
        "title": "Genin Takedown! All Nine Rookies Face Off!",
        "air_date": "Thu, Mar 13, 2003",
        "description": "All Konoha Genins are put to an introductory test to determine who will continue on in the actual exam.",
        "rating": "7.2",
        "votes": "1.2K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "24",
        "title": "Start Your Engines: The Chunin Exam Begins!",
        "air_date": "Thu, Mar 20, 2003",
        "description": "All Genins meet together and begin a written test as part of the first Chuunin Exam.",
        "rating": "7.9",
        "votes": "1.3K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "25",
        "title": "The Tenth Question: All or Nothing!",
        "air_date": "Thu, Mar 27, 2003",
        "description": "The Genins work on gathering information furtively while worries over the tenth question surface.",
        "rating": "7.9",
        "votes": "1.3K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "26",
        "title": "Special Report: Live from the Forest of Death!",
        "air_date": "Wed, Apr 2, 2003",
        "description": "A Naruto Special which recaps the previous 25 episodes and sets the stage for the second Chunnin exam.",
        "rating": "4.4",
        "votes": "1.1K",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "27",
        "title": "The Chunin Exam Stage 2: The Forest of Death",
        "air_date": "Wed, Apr 2, 2003",
        "description": "The second Chuunin Exam begins as the Genins start their search for two scrolls to enable them to finish the second Exam.",
        "rating": "7.4",
        "votes": "1.2K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "28",
        "title": "Eat or be Eaten: Panic in the Forest",
        "air_date": "Wed, Apr 9, 2003",
        "description": "The Genin teams continue their search for the two scrolls in the Forest of Death. Meanwhile, Team 7 is sidetracked by a powerful enemy.",
        "rating": "8.0",
        "votes": "1.3K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "29",
        "title": "Naruto's Counterattack: Never Give In!",
        "air_date": "Wed, Apr 16, 2003",
        "description": "Naruto and the rest of Team 7 continue their fight against their ruthless enemy in the Shi no Mori.",
        "rating": "8.2",
        "votes": "1.3K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "30",
        "title": "The Sharingan Revived: Dragon-Flame Jutsu!",
        "air_date": "Wed, Apr 23, 2003",
        "description": "Sasuke finally recovers his will to fight and receives a dangerous \"present\" from Orochimaru. The emergency surrounding Orochimaru in Konoha spreads to village officials.",
        "rating": "8.5",
        "votes": "1.4K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "31",
        "title": "Bushy Brow's Pledge: Undying Love and Protection!",
        "air_date": "Wed, Apr 30, 2003",
        "description": "Rock Lee and Sakura must defeat the Sound Genin in order to protect Naruto and Sasuke.",
        "rating": "7.6",
        "votes": "1.2K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "32",
        "title": "Sakura Blossoms!",
        "air_date": "Wed, May 7, 2003",
        "description": "The Sound Ninja attack incapacitated Team 7 and Sakura is left to fight them all.",
        "rating": "8.0",
        "votes": "1.3K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "33",
        "title": "Battle Formation: Ino-Shika-Cho!",
        "air_date": "Wed, May 14, 2003",
        "description": "Team 10 gains the courage to help Sakura defeat the Sound Genin.",
        "rating": "8.2",
        "votes": "1.3K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "34",
        "title": "Akamaru Trembles: Gaara's Cruel Strength!",
        "air_date": "Wed, May 21, 2003",
        "description": "The other Genin teams continue their search for the scrolls and Gaara's power is revealed to Team 8.",
        "rating": "7.7",
        "votes": "1.2K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "35",
        "title": "The Scroll's Secret: No Peeking Allowed",
        "air_date": "Wed, May 28, 2003",
        "description": "Naruto muses peeking into his team's scroll and Kabuto joins Team 7 in order to reach the tower in the center of the Forest of Death.",
        "rating": "7.0",
        "votes": "1.1K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "36",
        "title": "Clone vs. Clone: Mine are Better than Yours!",
        "air_date": "Wed, Jun 4, 2003",
        "description": "Team 7 and Kabuto engage the Rain ninja after breaking through the Rain ninjas' illusionary technique.",
        "rating": "7.4",
        "votes": "1.1K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "37",
        "title": "Surviving the Cut! The Rookie Nine Together Again!",
        "air_date": "Wed, Jun 11, 2003",
        "description": "Team 7 recovers their final scroll and completes the second Chûnin exam. However, a preliminary exam to the third Chûnin exam must be held to weed out the best Genins.",
        "rating": "6.8",
        "votes": "1.1K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "38",
        "title": "Narrowing the Field: Sudden Death Elimination!",
        "air_date": "Wed, Jun 18, 2003",
        "description": "Kabuto is secretly revealed to be a traitor to Konoha and Sasuke starts his match against Yoroi Akado.",
        "rating": "7.3",
        "votes": "1.1K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "39",
        "title": "Bushy Brow's Jealousy: Lions Barrage Unleashed!",
        "air_date": "Wed, Jul 2, 2003",
        "description": "Sasuke continues his fight against Yoroi Akado despite the pain from his Cursed Seal. Kakashi decides to help Sasuke after the battle by sealing the Cursed Seal.",
        "rating": "7.9",
        "votes": "1.2K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "40",
        "title": "Kakashi and Orochimaru: Face-to-Face!",
        "air_date": "Wed, Jul 9, 2003",
        "description": "Kakashi performs the sealing ritual on Sasuke, while the fight between Zaku Abumi and Shino Aburame commences.",
        "rating": "7.5",
        "votes": "1.1K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "41",
        "title": "Kunoichi Rumble: The Rivals Get Serious!",
        "air_date": "Wed, Jul 16, 2003",
        "description": "Misumi Tsurugi fights Kankuro and Sakura and Ino Yamanaka finally are forced to battle each other.",
        "rating": "6.6",
        "votes": "1.2K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "42",
        "title": "The Ultimate Battle: Cha!",
        "air_date": "Wed, Jul 23, 2003",
        "description": "The battle between Sakura and Ino intensifies as friendships and hardships between the two are revealed.",
        "rating": "6.8",
        "votes": "1.2K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "43",
        "title": "Killer Kunoichi and a Shaky Shikamaru",
        "air_date": "Wed, Jul 30, 2003",
        "description": "The third preliminary exam continues with Temari fighting Tenten and Shikamaru Nara battling Kin Tsuchi.",
        "rating": "7.5",
        "votes": "1.1K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "44",
        "title": "Akamaru Unleashed! Who's Top Dog Now?",
        "air_date": "Wed, Aug 6, 2003",
        "description": "Naruto finally gets his chance to fight against Team 8's Kiba Inuzuka.",
        "rating": "7.7",
        "votes": "1.2K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "45",
        "title": "Surprise Attack! Naruto's Secret Weapon!",
        "air_date": "Wed, Aug 13, 2003",
        "description": "Naruto's fight against Kiba draws to a climax and Naruto's newest \"techinque\" is introduced.",
        "rating": "7.9",
        "votes": "1.2K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "46",
        "title": "Byakugan Battle: Hinata Grows Bold!",
        "air_date": "Wed, Aug 20, 2003",
        "description": "Neji Hyuga and Hinata Hyuga fight to defend the honor of themselves and of their families.",
        "rating": "7.7",
        "votes": "1.2K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "47",
        "title": "A Failure Stands Tall!",
        "air_date": "Wed, Aug 27, 2003",
        "description": "Hinata decides to prove her worth against Neji as the battle between the two draws to a close.",
        "rating": "8.1",
        "votes": "1.2K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "48",
        "title": "Gaara vs. Rock Lee: The Power of Youth Explodes!",
        "air_date": "Wed, Sep 3, 2003",
        "description": "The youthful Rock Lee clashes against the powerful and deadly Gaara of the Sand.",
        "rating": "9.2",
        "votes": "3K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "49",
        "title": "Lee's Hidden Strength: Forbidden Secret Jutsu!",
        "air_date": "Wed, Sep 10, 2003",
        "description": "Rock Lee keeps fighting against the ferocious Gaara. Lee is weakened due to the use of his technique, Omote Renge, but his will is strong. In order to defeat Gaara, Lee would open the first gates, to be able to use a forbidden technique.",
        "rating": "8.9",
        "votes": "2K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "50",
        "title": "The Fifth Gate: A Splendid Ninja is Born",
        "air_date": "Wed, Sep 17, 2003",
        "description": "Lee finally reveals his trump card, the power of the Eight Gates, while Gaara prepares for a bloody showdown.",
        "rating": "9.2",
        "votes": "2.4K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "51",
        "title": "A Shadow in Darkness: Danger Approaches Sasuke",
        "air_date": "Wed, Sep 24, 2003",
        "description": "Choji Akimichi versus Dosu Kinuta in the final match of the third preliminary exam. Naruto learns he is getting a new trainer to prepare for the third Chuunin Exam.",
        "rating": "7.2",
        "votes": "1.1K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "52",
        "title": "Ebisu Returns: Naruto's Toughest Training Yet!",
        "air_date": "Wed, Oct 1, 2003",
        "description": "Naruto, in preparation for the third Chuunin Exam, begins his training with Ebisu, with some unexpected consequences.",
        "rating": "6.9",
        "votes": "1.1K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "53",
        "title": "Long Time No See: Jiraiya Returns!",
        "air_date": "Wed, Oct 8, 2003",
        "description": "While Ebisu trains Naruto on how to walk on water in a hot spring, he spies somebody trying to peep on women in a hot spring. Ebisu attacks him, only to be defeated quickly. Since Naruto's teacher has been knocked out, Naruto demands that the stranger become his teacher instead, but he has other plans. Naruto's Sexy Jutsu may be just the thing to get this pervert's attention.",
        "rating": "7.4",
        "votes": "1.1K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "54",
        "title": "The Summoning Jutsu: Wisdom of the Toad Sage!",
        "air_date": "Wed, Oct 15, 2003",
        "description": "While Jiraiya attempts to teach Naruto the Summoning Jutsu, while doing research as well, Dosu learns the hard way why Gaara is so dangerous. Meanwhile, Baki and Kabuto secretly meet and reveal a sinister plot against Konoha. When Hayate discovers this dark secret, he attempts to warn the Hokage. However, he'll have to get through Baki first!",
        "rating": "7.4",
        "votes": "1.1K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "55",
        "title": "A Feeling of Yearning, A Flower Full of Hope",
        "air_date": "Wed, Oct 22, 2003",
        "description": "Naruto keeps training on his 'kuchiyose no jutsu' skills, with little improvement, while Jiraiya-sensei prefers to focus his attention on 'researching for his next book', sneaking, looking the young women. In a meeting with the Hokage, it is told about the murder of Hayate Gekkô, the possible implication of Orochimaru and the Otogakure, but the Third Hokage decide to keep running the Chûnin Exams. Sakura is worry about Sasuke-kun and the 'Ten no Juin' Orochimaru left him. She tries again to visit him at the hospital, but first she stops at the Yamanaka flower shop. There she meet Ino who, of course decide to join Sakura in her visit to Sasuke. Sakura picks two flowers, one for Sasuke-kun and one for Lee. At the hospital, the girls discovers that Sasuke is gone. No one knew that he left. In Lee's room, there's no one neither.",
        "rating": "7.0",
        "votes": "1.1K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "56",
        "title": "Live or Die: Risk it All to Win it All!",
        "air_date": "Wed, Oct 29, 2003",
        "description": "Naruto finally learns how to summon the frog and release the power of the nine tails.",
        "rating": "7.7",
        "votes": "1.1K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "57",
        "title": "He Flies! He Jumps! He Lurks! Chief Toad Appears!",
        "air_date": "Wed, Nov 5, 2003",
        "description": "Naruto aims to prove to the frog boss that hed has summoned him. The sand villages' true motives become clearer.",
        "rating": "7.6",
        "votes": "1.1K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "58",
        "title": "Hospital Besieged: The Evil Hand Revealed!",
        "air_date": "Wed, Nov 12, 2003",
        "description": "Naruto wakes up in the hospital, after three days of recovering. He meets Shikamaru there, who went visit Chôji. Meanwhile, Sakura goes to visit Lee, and notices there's no one in the hospital reception. She feels something strange after changing Lee's flowers, but she sees nothing, so she leaves to visit Naruto. But the awkward presence is still there, and is a real danger: Gaara.",
        "rating": "7.6",
        "votes": "1.1K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "59",
        "title": "The Final Rounds: Rush to the Battle Arena!",
        "air_date": "Wed, Nov 19, 2003",
        "description": "The Second Part of the Chûnin Exams is about to begin. As every Genin who passed the first test is getting ready, Naruto feels really nervous. He meets Hinata who, timidly, wishes him the best. Naruto feels better, but as he get closer to the Arena, he finds some trouble to get on time.",
        "rating": "6.9",
        "votes": "1.1K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "60",
        "title": "Byakugan vs. Shadow Clone",
        "air_date": "Wed, Nov 26, 2003",
        "description": "Everyone is ready for the final part of the Chûnin Exams. Sasuke and Dosu hasn't arrived yet, so the referee, Jônin Genma Shiranui explains that if they don't arrive in time for their matches, they will be disqualified. This worries Sakura. First match is Naruto Uzumaki vs Neji Hyûga. Most audience members are betting for Neji, but Sakura and Hinata have faith in Naruto. Could the orphan boy, despised by most, defeat the talented and well trained member of the Hyûga Clan?",
        "rating": "7.6",
        "votes": "1.1K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "61",
        "title": "Ultimate Defense: Zero Blind Spot!",
        "air_date": "Wed, Dec 3, 2003",
        "description": "Naruto begins his assault with his Shadow Clones but Neji analyzes Naruto's actions and determines the real one. Unable to figure out why Naruto won't admit his defeat, he takes off his headband and reveal a mysterious mark on his forehead. Neji reveals the truth about his hatred towards the main family of the Hyuga Clan.",
        "rating": "7.9",
        "votes": "1.1K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "62",
        "title": "A Failure's True Power",
        "air_date": "Wed, Dec 10, 2003",
        "description": "Naruto and Neji's battle continues with Neji showing enormous power.",
        "rating": "8.8",
        "votes": "1.5K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "63",
        "title": "Hit it or Quit it: The Final Rounds Get Complicated!",
        "air_date": "Wed, Dec 17, 2003",
        "description": "Neiji is visited at the hospital by his uncle Hiashi to tell the truth about his father death.",
        "rating": "7.3",
        "votes": "1.1K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "64",
        "title": "Zero Motivation: The Guy with Cloud Envy!",
        "air_date": "Wed, Dec 24, 2003",
        "description": "Shikamaru fights to Temari on final part of the Chûnin Exams. Shikamaru personality is explained. This is a battle of strategy more than power.",
        "rating": "8.2",
        "votes": "1.2K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "65",
        "title": "Dancing Leaf, Squirming Sand",
        "air_date": "Wed, Dec 31, 2003",
        "description": "With Sasuke and Gaara's match needing to start, the Third Hokage (Hiruzen Sarutobi) sets a time limit for Sasuke to arrive. Sasuke arrives at the last minute with Kakashi Hatake.",
        "rating": "7.1",
        "votes": "1K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "66",
        "title": "Bushy Brow's Jutsu: Sasuke Style!",
        "air_date": "Wed, Jan 14, 2004",
        "description": "Sasuke and Kakashi has finally arrived. Now it is time for the match between Sasuke and Gaara.",
        "rating": "7.9",
        "votes": "1.1K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "67",
        "title": "Late for the Show, But Ready to Go! The Ultimate Secret Technique is Born!",
        "air_date": "Wed, Jan 14, 2004",
        "description": "Sasuke's enhanced speed and taijutsu skills enable him to bypass Gaara's sand-based defenses with ease, as Rock Lee did previously. Determined to kill Sasuke, Gaara retreats inside a sphere of sand and begins to transform.",
        "rating": "8.3",
        "votes": "1.2K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "68",
        "title": "Zero Hour! The Destruction of the Hidden Leaf Village Begins!",
        "air_date": "Wed, Jan 28, 2004",
        "description": "Orochimaru takes Hiruzen hostage as he has his personal bodyguards, the Sound Four, establish a barrier to so no one would interfere. Kankuro and Temari carry Gaara from the village so that he can recover with Sasuke in pursuit.",
        "rating": "8.1",
        "votes": "1.1K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "69",
        "title": "Village in Distress: A New A-Ranked Mission!",
        "air_date": "Wed, Feb 4, 2004",
        "description": "Kakashi instructs Sakura to wake Naruto and Shikamaru, and send them to an A-Rank mission: alongside ninja dog Pakkun, they must trace Sasuke to aid him in his fight against the Suna siblings. Meanwhile, Orochimaru begin his battle against his former sensei, Sandaime Hokage Sarutobi.",
        "rating": "7.9",
        "votes": "1.1K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "70",
        "title": "A Shirker's Call to Action: A Layabout No More!",
        "air_date": "Wed, Feb 11, 2004",
        "description": "Pakkun informs Sakura, Naruto and Shikamaru that they are being followed by 9 Otogakure shinobi. Thinking about a strategy to delay the enemy, Shikamaru offers himself as bait.",
        "rating": "7.8",
        "votes": "1.1K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "71",
        "title": "An Unrivaled Match: Hokage Battle Royale!",
        "air_date": "Wed, Feb 18, 2004",
        "description": "Orochimaru uses Edo Tensei and the fight between Shodai Hokage and Nidaime Hokage against Sandaime Hokage Sarutobi begins. Orochimaru reveals some of his true intentions.",
        "rating": "8.5",
        "votes": "1.2K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "72",
        "title": "A Mistake from the Past: A Face Revealed!",
        "air_date": "Wed, Feb 25, 2004",
        "description": "Sasuke catches up with the Suna siblings and Temari battles him, so Kankurô can take Gaara to recover. Meanwhile, Sandaime Hokage Sarutobi remembers the past and is finally ready to defeat Orochimaru.",
        "rating": "8.2",
        "votes": "1.1K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "73",
        "title": "Forbidden Secret Technique: Reaper Death Seal!",
        "air_date": "Wed, Mar 3, 2004",
        "description": "Third Hokage decides to use the last resource at his disposal, the same technique that in the past has saved the village of the leaf, meanwhile Sasuke reaches Kankuro and Gaara, a new battle promises.",
        "rating": "8.0",
        "votes": "1.1K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "74",
        "title": "Astonishing Truth! Gaara's Identity Emerges!",
        "air_date": "Wed, Mar 10, 2004",
        "description": "the predestined duel between Shino of the clan Aburame and Kankuro begins, while Gaara regains his strength but \"something\" inside him is awakening.",
        "rating": "8.0",
        "votes": "1.1K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "75",
        "title": "Sasuke's Decision: Pushed to the Edge!",
        "air_date": "Wed, Mar 17, 2004",
        "description": "The battle between Gaara and Sasuke continues and the monster inside the sand boy seems to feed on his old wounds. To neutralize the powerful opponent, the pupil of Kakashi goes beyond his limits with devastating consequences.",
        "rating": "7.9",
        "votes": "1.1K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "76",
        "title": "Assassin of the Moonlit Night",
        "air_date": "Wed, Mar 24, 2004",
        "description": "Through Gaara's migraines we discover his tormented childhood and from where his illness of life began. Meanwhile, Naruto decides to face him to protect his best friends.",
        "rating": "8.2",
        "votes": "1.1K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "77",
        "title": "Light vs. Dark: The Two Faces of Gaara",
        "air_date": "Wed, Mar 31, 2004",
        "description": "Yashamaru explains the truth to Gaara about his existence; Naruto tries to protect his friends while contemplating his and Gaara's similarities.",
        "rating": "8.0",
        "votes": "1.1K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "78",
        "title": "Naruto's Ninja Handbook",
        "air_date": "Wed, Apr 7, 2004",
        "description": "Naruto unleashes his handbook on Gaara and Gaara's true form is revealed.",
        "rating": "9.0",
        "votes": "1.7K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "79",
        "title": "Beyond the Limit of Darkness and Light",
        "air_date": "Wed, Apr 14, 2004",
        "description": "Once all women and children are evacuated, the Hidden Leaf Village launches its counter attack; Naruto defeats Gaara and Orochimaru has something precious taken from him.",
        "rating": "9.1",
        "votes": "1.9K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "80",
        "title": "The Third Hokage, Forever...",
        "air_date": "Wed, Apr 21, 2004",
        "description": "The villagers of Konoha unhappily go to the funeral of The Third Hokage.",
        "rating": "8.6",
        "votes": "1.3K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "81",
        "title": "Return of the Morning Mist",
        "air_date": "Wed, Apr 28, 2004",
        "description": "While the people of Konoha are trying to rebuild the village and go back to their normal lives, the appearance of two mysterious man threatens to disturb the newly-found peace.",
        "rating": "8.0",
        "votes": "1.1K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "82",
        "title": "Eye to Eye: Sharingan vs. Sharingan!",
        "air_date": "Wed, May 5, 2004",
        "description": "While Naruto prepares to go on a new adventure, Kakashi struggles to fight fellow Sharingan-user Itachi, former ninja of Konoha Village and member of a mysterious organization.",
        "rating": "8.4",
        "votes": "1.2K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "83",
        "title": "Jiraiya: Naruto's Potential Disaster!",
        "air_date": "Wed, May 12, 2004",
        "description": "Naruto starts his journey with Jiraiya, while Sasuke is angry and frustrated, because of the progress shown by his team-mate during the fight against Gaara.",
        "rating": "7.7",
        "votes": "1K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "84",
        "title": "Roar, Chidori! Brother vs. Brother!",
        "air_date": "Wed, May 19, 2004",
        "description": "Naruto is surprised by the arrival of the two Akatsuki members, while Sasuke thinks back to the day he saw his brother for the last time.",
        "rating": "8.7",
        "votes": "1.2K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "85",
        "title": "Hate Among the Uchihas: The Last of the Clan!",
        "air_date": "Wed, May 26, 2004",
        "description": "The arrival of Jiraiya saves Naruto from Kisame's attack, while Sasuke fights his brother and learns the strength difference between them.",
        "rating": "8.1",
        "votes": "1.1K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "86",
        "title": "A New Training Begins: I Will Be Strong!",
        "air_date": "Wed, Jun 2, 2004",
        "description": "Naruto and Jiraiya continue their journey in search of Tsunade and decide to stop in a city to rest, there, the toads hermit teaches a new technique to Naruto.",
        "rating": "7.1",
        "votes": "975",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "87",
        "title": "Keep on Training: Pop Goes the Water Balloon!",
        "air_date": "Wed, Jun 9, 2004",
        "description": "Under Jiraiya's tutelage Naruto learns to train like a ninja and not a kid, by himself.",
        "rating": "7.2",
        "votes": "958",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "88",
        "title": "Focal Point: The Mark of the Leaf",
        "air_date": "Wed, Jun 16, 2004",
        "description": "Naruto progresses in his training as Jiraiya is closer to tracking down Tsunade; but Orochimaru is after her too.",
        "rating": "7.4",
        "votes": "953",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "89",
        "title": "An Impossible Choice: The Pain Within Tsunade's Heart",
        "air_date": "Wed, Jun 23, 2004",
        "description": "Naruto continues with the third phase of his training to learn a new technique, while Orochimaru meets Tsunade and asks for her help.",
        "rating": "7.3",
        "votes": "951",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "90",
        "title": "Unforgivable! A Total Lack of Respect!",
        "air_date": "Wed, Jul 7, 2004",
        "description": "Jiraiya and Naruto finally find Tsunade as she groans within herself contemplating Orochimaru's offer.",
        "rating": "7.8",
        "votes": "979",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "91",
        "title": "Inheritence! The Necklace of Death!",
        "air_date": "Wed, Jul 14, 2004",
        "description": "Naruto learns Tsunade's story.",
        "rating": "7.6",
        "votes": "971",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "92",
        "title": "A Dubious Offer! Tsunade's Choice!",
        "air_date": "Wed, Jul 21, 2004",
        "description": "Naruto practices hard so he can win the necklace from Tsunade. Meanwhile, Tsunade is in a dilemma over Orochimaru's offer. Her hesitation to promptly refuse leads Kabuto to assume she'll take the offer.",
        "rating": "7.6",
        "votes": "969",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "93",
        "title": "Breakdown! The Deal is Off!",
        "air_date": "Wed, Jul 28, 2004",
        "description": "Gripped by the desire to see Nawaki and Dan, Tsunade almost succumbs to Orochimaru's tempting offer. But seeing Nawaki and Dan's dreams carried on by Naruto, she breaks off the deal. Orochimaru is determined to heal his arm and focuses on exploiting Tsunade's weakness.",
        "rating": "8.1",
        "votes": "1K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "94",
        "title": "Attack! Fury of the Rasengan!",
        "air_date": "Wed, Aug 4, 2004",
        "description": "Orochimaru and Kabuto use a summoning jutsu to call forth a giant snake. Still drugged and unable to fully use his chakra, Jiraiya summons little Gamakichi. Naruto also attempts a summoning jutsu, but ends up with Gamatatsu, Gamakichi's younger brother. Meanwhile, Kabuto has defeated Shizune. Naruto approaches Tsunade who is trembling in fear! Seething with anger, Naruto pulls himself up and tries to attack...",
        "rating": "8.7",
        "votes": "1.2K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "95",
        "title": "The Fifth Hokage! A Life on the Line!",
        "air_date": "Sat, Jul 7, 2007",
        "description": "Naruto's ninja way is to never go back on his word. Naruto is seriously injured by Kabuto and hovers on the verge of death. Tsunade places her last shred of hope in Naruto who shares Nawaki and Dan's dreams. Tsunade has a fear of blood, but through her desire to protect Naruto, she is able to overcome it.",
        "rating": "8.4",
        "votes": "1.1K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "96",
        "title": "Deadlock! Sannin Showdown!",
        "air_date": "Wed, Aug 11, 2004",
        "description": "Jiraiya, Tsunade and Orochimaru all release their summoning jutsu. And a fierce battle begins. Jiraiya and Tsunade join forces against Orochimaru. Despite her injuries, Tsunade desperately challenges Orochimaru. The toad, snake and slug engage!",
        "rating": "8.3",
        "votes": "1.1K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "97",
        "title": "Kidnapped! Naruto's Hot Spring Adventure!",
        "air_date": "Wed, Aug 18, 2004",
        "description": "Naruto help some guys make Tsunade pay her debt and Jiraiya spends the day in a spa waiting for pretty girls.",
        "rating": "6.2",
        "votes": "812",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "98",
        "title": "Tsunade's Warning: Ninja No More!",
        "air_date": "Sat, Jul 28, 2007",
        "description": "Naruto asks Tsunade to heal Sasuke and Lee before she is installed as the Hokage. After examining Lee, she tells him to find a path other than of that of a shinobi.",
        "rating": "7.1",
        "votes": "921",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "99",
        "title": "The Will of Fire Still Burns!",
        "air_date": "Wed, Sep 1, 2004",
        "description": "Tsunade gets to work as the fifth hokage and Konohamaru acts out of turn.",
        "rating": "6.8",
        "votes": "874",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "100",
        "title": "Sensei and Student: The Bond of the Shinobi",
        "air_date": "Wed, Sep 8, 2004",
        "description": "Guy sensei encourages Rock Lee by reminding him of his ninja way.",
        "rating": "7.7",
        "votes": "985",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "101",
        "title": "Gotta See! Gotta Know! Kakashi-Sensei's True Face!",
        "air_date": "Wed, Sep 15, 2004",
        "description": "Naruto, Sasuke and Sakura have always wanted to see what Kakashi looks like under his mask. The three do whatever they can to reveal his whole face.",
        "rating": "7.4",
        "votes": "955",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "102",
        "title": "Mission: Help an Old Friend in the Land of Tea",
        "air_date": "Wed, Sep 22, 2004",
        "description": "Naruto, Sakura and Sasuke find out their newest mission will be without Kakashi who has responsibilities elsewhere. Tsunade sends them to the Tea Country to protect someone, but the details are vague at best. Along the way they meet Idate Morino who causes the group a lot of trouble, especially when they discover who they have to protect.",
        "rating": "6.5",
        "votes": "720",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "103",
        "title": "The Race is on! Trouble on the High Seas!",
        "air_date": "Wed, Sep 29, 2004",
        "description": "The trio continue to follow Idate while fending off attacks by three Shinobi sent to kill him. They find out later just how important winning this race is to the Wasabi clan's future.",
        "rating": "6.4",
        "votes": "717",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "104",
        "title": "Run Idate Run! Nagi Island Awaits!",
        "air_date": "Wed, Oct 13, 2004",
        "description": "Naruto and his squad manage to catch up to Idate, only to find him hurt and unconscious with Aoi nearby.",
        "rating": "6.6",
        "votes": "706",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "105",
        "title": "A Fierce Battle of Rolling Thunder!",
        "air_date": "Wed, Oct 20, 2004",
        "description": "With Naruto's help, Idate reaches the Modoroki Shrine - But just as he's about to cross the bridge, an old nemesis stands in his way.",
        "rating": "6.8",
        "votes": "700",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "106",
        "title": "The Last Leg: A Final Act of Desperation",
        "air_date": "Wed, Oct 27, 2004",
        "description": "Now that Sasuke and Sakura are trapped at the bottom of a cliff, it's up the Number One Knucklehead Ninja to defeat the malevolent Aoi and help Idate cross the finish line.",
        "rating": "6.7",
        "votes": "712",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "107",
        "title": "The Battle Begins: Naruto vs. Sasuke",
        "air_date": "Wed, Nov 3, 2004",
        "description": "Hospital bound and feeling his pride shattered, Sasuke finds there is only way to redeem himself: Battle Naruto. Meanwhile, the Ino-Shika-Cho Squad sit down for some barbecue to celebrate a special occasion.",
        "rating": "8.2",
        "votes": "1K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "108",
        "title": "Bitter Rivals and Broken Bonds",
        "air_date": "Wed, Nov 10, 2004",
        "description": "As their rivalry reaches a fever pitch, Kakashi-sensei breaks up the battle and sends Naruto and Sasuke to their corners. Meanwhile, Four Sound ninja enter the Hidden Leaf Village with only one thing on their mind - Sasuke.",
        "rating": "7.9",
        "votes": "968",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "109",
        "title": "An Invitation from the Sound",
        "air_date": "Wed, Nov 17, 2004",
        "description": "Sasuke takes on all four Sound Ninja, but soon learns it's going to take more than Chidori to defeat them.",
        "rating": "8.1",
        "votes": "1K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "110",
        "title": "Formation! The Sasuke Retrieval Squad",
        "air_date": "Wed, Nov 24, 2004",
        "description": "Now that word of Sasuke's departure has spread to the Fifth Hokage, she calls upon the newest Chunin, Shikamaru, to put together a squad to bring Sasuke back to the village.",
        "rating": "8.0",
        "votes": "972",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "111",
        "title": "Sound vs. Leaf",
        "air_date": "Wed, Nov 24, 2004",
        "description": "The Sound Ninja have Sasuke in their clutches and it's up to the Hidden Leaf Village's top Shinobi to stop them.",
        "rating": "7.7",
        "votes": "929",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "112",
        "title": "Squad Mutiny: Everything Falls Apart!",
        "air_date": "Wed, Dec 1, 2004",
        "description": "As Shikamaru and the rest of the squad move in, Jirobo, one of the Sound Ninja, traps them within an Earth Dome Prison and sucks up their chakra.",
        "rating": "7.8",
        "votes": "919",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "113",
        "title": "Full Throttle Power! Choji, Ablaze!",
        "air_date": "Wed, Dec 8, 2004",
        "description": "Upon breaking free from the Earth Dome Prison, The Sasuke Retrieval Squad realize they don't have enough chakra to take on Jirobo - but Choji's got another idea up his sleeve.",
        "rating": "7.7",
        "votes": "931",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "114",
        "title": "Good-bye Old Friend...! I'll Always Believe in You!",
        "air_date": "Wed, Dec 15, 2004",
        "description": "With his life on the line against the Sound Ninja Jirobo, Choji looks back on the seeds of his friendship with Shikamaru. Can he defeat his fearsome opponent without any Chakra?",
        "rating": "8.7",
        "votes": "1.2K",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "115",
        "title": "Your Opponent Is Me!",
        "air_date": "Wed, Dec 22, 2004",
        "description": "Hot on Sasuke's trail, Shikamaru and his squad get caught up in a web of unparalleled chakra when they tangle with the six-armed Kidomaru.",
        "rating": "7.8",
        "votes": "933",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "116",
        "title": "360 Degrees of Vision: The Byakugan's Blind Spot",
        "air_date": "Wed, Jan 5, 2005",
        "description": "Neji takes on Kidômaru while the others continue their pursuit of Sasuke and the remaining Sound ninja.",
        "rating": "8.0",
        "votes": "958",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "117",
        "title": "Losing is Not an Option!",
        "air_date": "Wed, Jan 5, 2005",
        "description": "Neji's on the run from Kidomaru's bow and arrow attacks. Will Neji make it out alive or will his new-found enemy hit his blind-spot dead on?",
        "rating": "8.8",
        "votes": "1.5K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "118",
        "title": "The Vessel Arrives Too Late",
        "air_date": "Wed, Jan 12, 2005",
        "description": "In pursuit of the Sound Ninja, Naruto, Kiba and Shikamaru strike at dawn to retrieve Sasuke and bring him back to the Hidden Leaf Village.",
        "rating": "7.6",
        "votes": "906",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "119",
        "title": "Miscalculation: A New Enemy Appears!",
        "air_date": "Wed, Jan 19, 2005",
        "description": "Naruto, Kiba and Shikamaru intercept Sasuke from the Sound Ninja Four, but little do they know that another ninja from the Sound Village has been dispatched to grab Sasuke as well.",
        "rating": "7.6",
        "votes": "902",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "120",
        "title": "Roar and Howl! The Ultimate Tag Team",
        "air_date": "Wed, Feb 2, 2005",
        "description": "Faced against the vicious twin duo of Sakon and Ukon, Kiba and Akamaru team up to take them out, using their most powerful jutsu.",
        "rating": "7.6",
        "votes": "909",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "121",
        "title": "To Each His Own Battle",
        "air_date": "Wed, Feb 9, 2005",
        "description": "With the Sasuke retrieval squad now split into individual battles, it's up to Naruto, Kiba and Shikamaru to stop the sound ninja. But little do they realize that there's more to their opponents than their basic techniques.",
        "rating": "7.6",
        "votes": "901",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "122",
        "title": "Fakeout: Shikamaru's Comeback!",
        "air_date": "Wed, Feb 16, 2005",
        "description": "Shikamaru's got his hands full with Tayuya and her melodic attacks. Can he stop her and put an end to her malevolent flute playing?",
        "rating": "8.0",
        "votes": "937",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "123",
        "title": "The Leaf's Handsome Devil!",
        "air_date": "Wed, Feb 23, 2005",
        "description": "Naruto's Shadow Clones are no match for Kimimaro's attacks. But when an old bushy-brow-ed buddy from the Leaf Village shows up, all bets are off.",
        "rating": "8.0",
        "votes": "968",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "124",
        "title": "The Beast Within",
        "air_date": "Wed, Mar 2, 2005",
        "description": "Rock Lee's back and he's full of a special medicine that has Kimimaro on the run. Can he take out the fifth Sound Ninja?",
        "rating": "8.8",
        "votes": "1.3K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "125",
        "title": "The Sand Shinobi: Allies of the Leaf",
        "air_date": "Wed, Mar 9, 2005",
        "description": "Down for the count and at the mercy of the Sound Ninja, Kiba, Shikamaru and Rock Lee get help from an unlikely bunch of new allies.",
        "rating": "8.4",
        "votes": "1.1K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "126",
        "title": "Showdown: Gaara vs. Kimimaro!",
        "air_date": "Wed, Mar 16, 2005",
        "description": "Itching to fight and with a sense of guilt from the past, Gaara tells Rock Lee to stand down and let him take on Kimimaro. Meanwhile, Naruto continues on his quest to catch the runaway Sasuke.",
        "rating": "8.3",
        "votes": "984",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "127",
        "title": "Vengeful Strike! The Bracken Dance",
        "air_date": "Wed, Mar 30, 2005",
        "description": "As Gaara demonstrates he has more than enough backbone to take on Kimimaro, Orochimaru recollects on how he brought him as a young man into the Sound Village.",
        "rating": "8.2",
        "votes": "973",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "128",
        "title": "A Cry on Deaf Ears",
        "air_date": "Wed, Mar 30, 2005",
        "description": "Finally catching up to Sasuke, Naruto does all he can to keep him from going to Orochimaru. Does he have enough strength to stop him or is Sasuke gone for good?",
        "rating": "8.0",
        "votes": "964",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "129",
        "title": "Brothers: Distance Among the Uchiha",
        "air_date": "Wed, Apr 6, 2005",
        "description": "Naruto and Sasuke face off in battle as we get a glimpse into Sasuke's past where his achievements were ignored by his father and his brother Itachi's behavior began to take a turn for the worst.",
        "rating": "8.1",
        "votes": "985",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "130",
        "title": "Father and Son, the Broken Crest",
        "air_date": "Wed, Apr 13, 2005",
        "description": "As Sasuke squares off against Naruto, he reflects on his past when he was neglected by both his stern father and Itachi, his brooding older brother.",
        "rating": "7.8",
        "votes": "940",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "131",
        "title": "The Secrets of the Mangekyo Sharingan!",
        "air_date": "Wed, Apr 13, 2005",
        "description": "While Naruto is busy underwater, Sasuke remembers the fateful day in which his clan was killed. He remembers why Itachi spared his life, and why Itachi did what what he did. Now, in order to gain the same power as his brother, he must kill his closest friend...Naruto.",
        "rating": "8.0",
        "votes": "999",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "132",
        "title": "For a Friend",
        "air_date": "Wed, Apr 27, 2005",
        "description": "Kakashi learns the truth about the chase after Sasuke, and orders his dogs, including Pakkun, to go find Naruto and Sasuke. However, things are looking grim as the clash between the Chindori and the Rasengan ensues. Though the attacks even, Naruto finally realizes how serious Sasuke is. During the fight, he remembers how he always wanted to be friends with Sasuke.",
        "rating": "8.9",
        "votes": "1.5K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "133",
        "title": "A Plea From a Friend",
        "air_date": "Wed, May 4, 2005",
        "description": "Naruto proves to be too much for Sasuke to handle as Naruto fights back with renewed vigor. Finally acknowledging Naruto's strength, Sasuke puts on his forehead protector, symbolizing both as equals. But when Sasuke's Sharingan is upgraded to level 3, the tables turn on Naruto. Just when all hope seems lost for Naruto, he undergoes a startling transformation, but will it be enough?",
        "rating": "9.4",
        "votes": "2.8K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "134",
        "title": "The End of Tears",
        "air_date": "Wed, May 11, 2005",
        "description": "The battle between Naruto and Sasuke comes to a close, as One-Tailed Naruto takes on Cursed Seal Level 2 Sasuke in one final Rasengan vs. Chidori clash. And this time...only one person will emerge victorious. Will Kakashi and Pakkun make it in time? And who is this mysterious ninja watching everything?",
        "rating": "9.1",
        "votes": "1.7K",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "135",
        "title": "The Promise That Could Not Be Kept",
        "air_date": "Wed, May 18, 2005",
        "description": "Shikamaru's group is brought back to Konoha with many injuries. Neji and Chouji could possibly die, Kiba has a deep wound but nothing too serious, and Naruto and Shimakamru have a few injuries. When Sakura finds out they are back ,she goes immediately to see Sasuke and Naruto but finds out Sasuke got away. Can Naruto keep his promise to Sakura? And what news does the Jiraiya have for Naruto?",
        "rating": "8.2",
        "votes": "964",
        "type": "Manga Canon"
    },
    {
        "season": "1",
        "episode": "136",
        "title": "Deep Cover!? A Super S-Ranked Mission!",
        "air_date": "Wed, May 25, 2005",
        "description": "Jiraiya begins to worry about Naruto and Sakura's well-being. He then requests that Tsunade send them on a mission with him. He finds Naruto telling Sakura he is not going to stop her from going after Sasuke, but he is going with her, and tells them about the mission. They head off to Rice Country to find the Hidden Sound Village, and hopefully Sasuke as well.",
        "rating": "6.5",
        "votes": "622",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "137",
        "title": "A Town of Outlaws, the Shadow of the Fuma Clan",
        "air_date": "Wed, Jun 1, 2005",
        "description": "Naruto, Sakura and Jiraiya end up in a town that is even worse than the one they were chased out of. Jiraiya heads off and leaves Naruto and Sakura to get some food. Along the way they find the ninja that attacked them before, but things are not as clear-cut as they might seem.",
        "rating": "6.6",
        "votes": "598",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "138",
        "title": "Pure Betrayal, and a Fleeting Plea!",
        "air_date": "Wed, Jun 8, 2005",
        "description": "When Sasame drugs the gang, she prepares to hand them over to Orochimaru. But, when she discovers that they are to be killed, she has a change of heart.",
        "rating": "6.6",
        "votes": "589",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "139",
        "title": "Pure Terror! The House of Orochimaru",
        "air_date": "Wed, Jun 15, 2005",
        "description": "Sasame leads Naruto, Jiraiya, and Sakura to Orochimaru's hideout. They send Sasame back to the village because of the danger level. Jiraiya summons Gamakichi to go in first and investigate. The four come to three tunnels. Jiraiya goes off to the right, Naruto and Sakura down the middle and Gamakichi down the left. Will the four of them make it past the traps?",
        "rating": "7.0",
        "votes": "596",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "140",
        "title": "Two Heartbeats: Kabuto's Trap",
        "air_date": "Wed, Jun 22, 2005",
        "description": "Naruto arrives in the nick of time to save Sakura, but not before Kabuto tells her that Sasuke is dead. Naruto attacks but ends up tangled in a deadly trap of Kabuto's. Is it all over for our hero and will they find Arashi?",
        "rating": "6.9",
        "votes": "596",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "141",
        "title": "Sakura's Determination",
        "air_date": "Wed, Jun 29, 2005",
        "description": "The battle between Naruto and Arashi continues, but Naruto's injury is making it difficult for him to succeed. Sasame jumps in to try to save Naruto but will it be enough?",
        "rating": "6.9",
        "votes": "651",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "142",
        "title": "The Three Villains from the Maximum Security Prison",
        "air_date": "Sat, Feb 23, 2008",
        "description": "With the events of the Rice Field Country behind them, everyone prepares for their training. But a new threat soon arises. Remember Mizuki? He's back and he's planning to break out of Konoha's Correctional Facility, along with two stupid, fat brothers..",
        "rating": "6.3",
        "votes": "615",
        "type": "Mixed Canon/Filler"
    },
    {
        "season": "1",
        "episode": "143",
        "title": "Tonton! I'm Counting on You!",
        "air_date": "Wed, Jul 13, 2005",
        "description": "Shizune pursues Mizuki who has escaped from the Maximum Security Prison, but is overcome by him and the brothers Raijin and Fujin. - This Episode is part of Season 3, Volume 3",
        "rating": "6.3",
        "votes": "558",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "144",
        "title": "A New Squad! Two People and a Dog?!",
        "air_date": "Wed, Jul 20, 2005",
        "description": "Naruto is having trouble with the two brothers and Iruka is having his share of difficulties with Mizuki. Iruka struggles to try and get the old Mizuki back but he doesn't have much success. - Meanwhile, when things are looking bleak for Naruto, can 3 friendly Ninja save the day?",
        "rating": "6.1",
        "votes": "563",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "145",
        "title": "A New Formation: Ino-Shika-Cho!",
        "air_date": "Wed, Jul 27, 2005",
        "description": "Naruto's backup has arrived and they are Shikamaru, Ino, and Chouji. They tell Naruto that they will take care of the brothers. Naruto leaves to catch up to Iruka, who is fighting Mizuki. Can Naruto arrive before Mizuki kills Iruka? And can Shikamaru, Ino, and Chouji hold off the brothers?",
        "rating": "6.3",
        "votes": "557",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "146",
        "title": "Orochimaru's Shadow",
        "air_date": "Wed, Aug 10, 2005",
        "description": "Naruto and his squad start their first ninja missions with boring and menial tasks. Weary and angry, Naruto vents his frustration at the Hokage. - This Episode is part of Season 1, Volume 1",
        "rating": "6.3",
        "votes": "550",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "147",
        "title": "A Clash of Fate: You Can't Bring Me Down",
        "air_date": "Wed, Aug 17, 2005",
        "description": "Mizuki is determined to make Naruto and Iruka suffer and it appears that he has the upper edge with his improved strength and speed. Shikamaru, Ino and Chouji are also at their limits and now Fuujin and Raijin are free. Can Tsunade arrive in time to help?",
        "rating": "6.5",
        "votes": "557",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "148",
        "title": "Search for the Rare Bikochu Beetle",
        "air_date": "Sat, Mar 15, 2008",
        "description": "Naruto is unable to search for Sasuke due to Tsunade's orders, while Kiba and Hinata wonder how they can help him out. Shino remembers a special type of bug that if it is found, could easily track Sasuke down. they go and discuss it with Tsunade, who agrees to let them search for it, making Shino the leader. Tsunade discovers Naruto eavesdropping the conversation and lets him go with them. But, can they complete a mission with only a 10% success rate? As they travel, Naruto has difficulty dealing with Shino's bizarre behavior. Hinata also sneaks out in the middle of the night to practice some mysterious moves. After two days of traveling, they finally reach their destination. And they're not alone, a mysterious group is also after the same thing.",
        "rating": "6.9",
        "votes": "577",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "149",
        "title": "What's the Difference? Don't All Insects Look Alike?",
        "air_date": "Sat, Mar 15, 2008",
        "description": "The group struggles to find a Bikouchuu, but seem to fail at every turn. When it starts to rain they realize they only have one more chance to find it, will Hinata's Byakugan be enough?",
        "rating": "7.0",
        "votes": "588",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "150",
        "title": "A Battle of Bugs: The Deceivers and the Deceived",
        "air_date": "Sat, Mar 22, 2008",
        "description": "With Hinata's safety in danger, the group must try and figure out a way to save her and protect the Bikouchuu at the same time. Every time one side seems to have an edge though, the other reveals yet a new trick. As dawn approaches, they don't have long left....can they succeed?",
        "rating": "6.8",
        "votes": "555",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "151",
        "title": "Blaze Away Byakugan: This Is My Ninja Way",
        "air_date": "Sat, Mar 22, 2008",
        "description": "With the group trapped, Shino makes a deal to trade the Bikouchuu for Hinata. Unfortunately for the opponents, Hinata got away, making the deal worthless. They begin to attack but can Hinata show up to save the day?",
        "rating": "7.2",
        "votes": "576",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "152",
        "title": "Funeral March for the Living",
        "air_date": "Wed, Sep 21, 2005",
        "description": "When Naruto rescues three strangers he finds himself dragged into yet another mission. However, this time he doesn't want to partake in it. That is until he hears that there might be a connection to Akatsuki. With Neji, Lee and Tenten as his teammates, will he find the information he is looking for?",
        "rating": "6.3",
        "votes": "549",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "153",
        "title": "A Lesson Learned: The Iron Fist of Love",
        "air_date": "Wed, Sep 28, 2005",
        "description": "Out to try and save Rourusuke, Naruto and the others ambush members of the Kurosuke Family and save an old man. They soon hear the funeral bell and go and save Rourusuke. However, Rock lee meets an old friend among the group, and Lee must now convince Kurashi to return his his old way of life. Their time together is cut short, as Raiga watches from the sidelines. Can Naruto, Neji, Rock Lee, and Tenten defeat an enemy that not even Neji's Byakugan can see?",
        "rating": "6.1",
        "votes": "539",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "154",
        "title": "The Enemy of the Byakugan",
        "air_date": "Wed, Oct 5, 2005",
        "description": "Naruto, Tenten, Neji and Lee continue their mission to stop Raiga and save the Rourusuke Family. They try to work out a plan but the thick fog makes it difficult for them to see. Even Neji's Byakugan doesn't seem to help. Lee fights Raiga and manages to knock a bag off his back. What is this bag and what is inside it that seems so important? Meanwhile Naruto steps up to battle Raiga. Will he be able to defeat him?",
        "rating": "6.4",
        "votes": "541",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "155",
        "title": "The Dark Creeping Clouds",
        "air_date": "Thu, Sep 29, 2005",
        "description": "Naruto, Neji, Rock Lee, and Tenten continue their fight against Raiga",
        "rating": "6.2",
        "votes": "531",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "156",
        "title": "Raiga's Counterattack",
        "air_date": "Sat, Nov 5, 2005",
        "description": "The group discovers that Ranmaru and Karashi are missing from the curry shop.",
        "rating": "6.1",
        "votes": "531",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "157",
        "title": "Run! The Curry of Life",
        "air_date": "Wed, Oct 26, 2005",
        "description": "Lee is left facing Raiga alone while Tenten and the others hurry to bring them the curry of life. Ranmaru is reunited with Raiga, but are things the same as they were before?",
        "rating": "6.5",
        "votes": "543",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "158",
        "title": "Follow My Lead! The Great Survival Challenge",
        "air_date": "Sat, Apr 19, 2008",
        "description": "Every Genin is assigned a squad of Cadets to lead on a mission that forces all of them to race to the top of a mountain to retrieve a scroll and, wouldn't you know it, guess who Naruto ends up leading? Its none other than the Konohamaru corps. However, when a storm causes the mission to be canceled without his knowing, he will have to be a better leader than ever to keep his team alive.",
        "rating": "6.4",
        "votes": "536",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "159",
        "title": "Bounty Hunter from the Wilderness",
        "air_date": "Sat, Apr 19, 2008",
        "description": "Naruto, Hinata and Kiba are sent off on a mission to capture a thief named Gosunkugi. However, on the way they meet another bounty hunter, who is after the same target as them..",
        "rating": "6.2",
        "votes": "527",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "160",
        "title": "Hunt or Be Hunted?! Showdown at the O.K. Temple!",
        "air_date": "Wed, Nov 16, 2005",
        "description": "Turns out Sazanami is really a wanted criminal named Toukichi who is wanted for the murder of a family of three. Truth is however, he's innocent, and wants to capture the man responsible to prove it. Sazanami teams up with the Konoha group to stop Gosunki once and for all..",
        "rating": "6.0",
        "votes": "534",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "161",
        "title": "The Appearance of Strange Visitors",
        "air_date": "Wed, Nov 23, 2005",
        "description": "As Gai and Lee leave Konoha on a mission, two strangers disguise themselves as them and sneak into the village to learn its secrets. Tsunade, Sakura and Tenten have big plans in store for these impostors, plans that'll make their lives miserable.",
        "rating": "5.5",
        "votes": "557",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "162",
        "title": "The Cursed Warrior",
        "air_date": "Wed, Nov 30, 2005",
        "description": "Naruto, Tenten, and Neji travel to the Bird Country to exterminate a ghost named Noroimusha.",
        "rating": "5.8",
        "votes": "523",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "163",
        "title": "The Tactician's Intent",
        "air_date": "Wed, Dec 7, 2005",
        "description": "Naruto and the others attempt to prove that Kouhmei is the one responsible for the ghost. However, what Naruto and the gang discover leaves even more mysteries unsolved.",
        "rating": "6.0",
        "votes": "514",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "164",
        "title": "Too Late for Help",
        "air_date": "Wed, Dec 14, 2005",
        "description": "Naruto decides to do some investigating on his own over the matter of the ghost, while Neji and Tenten try a different approach. With the help of two frogs, Naruto begins to learn more and more about the truth of the matter....but will what he discovers, cost him his life?",
        "rating": "6.0",
        "votes": "516",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "165",
        "title": "The Death of Naruto",
        "air_date": "Wed, Dec 21, 2005",
        "description": "Kakashi orders Neji and Tenten to return to the village with him, much to their protest. Meanwhile Koumei is about to be executed, at least until the Noroimusha shows up. Is the ghost an ally or an enemy and whatever became of Naruto? Questions are answered as Sagi reveals the truth.",
        "rating": "6.3",
        "votes": "515",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "166",
        "title": "When Time Stands Still",
        "air_date": "Wed, Jan 4, 2006",
        "description": "Sagi prepares his plans for revenge and he won't let anyone stand in his way. Disguised as the Noroimusha, he confronts Musou, but shocking news is revealed when they both reveal their true identities.",
        "rating": "6.1",
        "votes": "515",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "167",
        "title": "When Egrets Flap Their Wings",
        "air_date": "Wed, Jan 4, 2006",
        "description": "Shima saves Naruto from Ooki's genjutsu trap and proceeds to try and protect him. When all seems lost for our hero, a mysterious white figure appears and asks him to grant one last wish. Will Naruto find the strength to grant this request and save the day?",
        "rating": "5.9",
        "votes": "514",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "168",
        "title": "Mix It, Stretch It, Boil It Up! Burn, Copper Pot, Burn!",
        "air_date": "Wed, Jan 18, 2006",
        "description": "Mr. Ichiraku, the owner of the Ichiraku Ramen shop is in trouble. His daughter has been kidnapped and he only has two days to win her back. Can Nauruto, Chouji and Sakura help Mr. Ichiraku win the contest, or will he have to hand over his Legendary Ramen recipe?",
        "rating": "5.8",
        "votes": "527",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "169",
        "title": "Remembrance: The Lost Page",
        "air_date": "Wed, Jan 25, 2006",
        "description": "Being some of the few Genins available, Naruto, Ino, and Shino are forced to accompany Anko on her mission to the Sea Country to destroy a sea monster and protect a boat carrying gold. However, Anko is acting strange as she begins to remember more and more events from her past, and the connection she once had with Orochimaru.",
        "rating": "6.5",
        "votes": "517",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "170",
        "title": "The Closed Door",
        "air_date": "Wed, Feb 1, 2006",
        "description": "Naruto is recovering thanks to the mysterious girl, Isaribi. While Naruto is recovering, Anko, Shino, and Ino search for him and also meet the man in charge of the payroll shipment. The group eventually meets back up, but not before finding the sea monster's lair.",
        "rating": "6.5",
        "votes": "516",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "171",
        "title": "Infiltration: The Set-Up!",
        "air_date": "Wed, Feb 8, 2006",
        "description": "After Isaribi escapes, Naruto and his team decide to go to the forbidden island and confront Orochimaru and his subordinates. They soon discover that Orochimaru is not the man behind the curtain, but a man known as Amachi. Amachi is the one responsible for turning Isaribi into a monster, so why is she helping him?",
        "rating": "6.5",
        "votes": "509",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "172",
        "title": "Despair: A Fractured Heart",
        "air_date": "Wed, Feb 15, 2006",
        "description": "After narrowly escaping the collapsing lab, Naruto and the others must catch up to the money convoy. However, Amachi has already set his trap, and the convoy crew has taken the bait. Naruto and the others arrive to save the day, as all of them prepare for battle. But can the group defeat Amachi when he reveals his true self? And what will happen when Isaribi realizes how far Naruto will go to save her?",
        "rating": "6.3",
        "votes": "511",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "173",
        "title": "The Battle at Sea: The Power Unleashed!",
        "air_date": "Wed, Feb 22, 2006",
        "description": "Naruto and Amachi's battle comes to a rather quick end, or does it? Also, Anko recovers more of her past including a significant event.",
        "rating": "6.7",
        "votes": "516",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "174",
        "title": "Impossible! Celebrity Ninja Art - Money Style Jutsu!",
        "air_date": "Wed, Mar 1, 2006",
        "description": "Naruto guides Kunijiro, a young rich boy visiting Tsunade, through a day in the life of a ninja.",
        "rating": "5.1",
        "votes": "528",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "175",
        "title": "The Treasure Hunt is On!",
        "air_date": "Sat, Jun 14, 2008",
        "description": "Naruto, Kiba, and Hinata are ordered on a special mission: A treasure hunt. There is a downside though; if they fail the mission, they have to go back to the Academy. They set off confident that the mission will be easy, but still worried about having to go back to the academy. Everything is going as well as expected until some mysterious characters show up. Can Naruto and crew find the gold, or will they have to go back to the Academy with the other little kids?",
        "rating": "6.3",
        "votes": "500",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "176",
        "title": "Run, Dodge, Zigzag! Chase or Be Chased!",
        "air_date": "Mon, Jul 21, 2008",
        "description": "Naruto, Kiba, and Hinata must make it back to Konoha and stop their evil look-a-likes from ruining their village. The impostors think it'll be an easy task, but when the real Naruto and Kiba expose their weakness, they discover that it may not be so easy.",
        "rating": "6.3",
        "votes": "506",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "177",
        "title": "Please, Mr. Postman!",
        "air_date": "Wed, Mar 22, 2006",
        "description": "Naruto accidentally meets up with Jiraiya and demands that he trains him. Jiraiya refuses however, as he has to finish the next volume of his series. Anxiously wanting to train, Naruto tries to help and as usual, it all goes wrong. Naruto and Jiraiya vs the Courier Ninja, who will come out on top?",
        "rating": "6.0",
        "votes": "513",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "178",
        "title": "Encounter! The Boy with a Star's Name",
        "air_date": "Wed, Mar 29, 2006",
        "description": "About 200 years, a star fell to the Hidden Star Village. This star supposedly as mystic powers. However, the village has few ninja, so they require the help of other villages. Naruto accompanies Lee, Neji, and Tenten on a mission to protect it.",
        "rating": "6.0",
        "votes": "497",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "179",
        "title": "The Remembered Lullaby",
        "air_date": "Wed, Apr 5, 2006",
        "description": "When the mysterious attacker flies away with the star, using only their Chakra, the Konoha group are left in the dust. They swear to reclaim the star but it isn't as simple as they might hope. Meanwhile, Naruto learns some of Subaru's history and Natsuhiboshi.",
        "rating": "6.0",
        "votes": "497",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "180",
        "title": "Hidden Jutsu: The Price of The Ninja Art: Kujaku",
        "air_date": "Wed, Apr 12, 2006",
        "description": "The Konoha team continue to investigate the star's theft and start to realize everything is not quite as it seems. Everything seems to be leading to a final battle, but who is the real enemy behind all this?",
        "rating": "6.2",
        "votes": "498",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "181",
        "title": "Hoshikage, The Buried Truth",
        "air_date": "Nov 2007",
        "description": "Naruto has been rescued by the mysterious woman and soon learns who she really is. Can the two of them continue the mission the was started so very long ago and what will Subaru think when he discovers the truth?",
        "rating": "6.0",
        "votes": "492",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "182",
        "title": "Reunion, The Remaining time",
        "air_date": "Wed, Apr 26, 2006",
        "description": "Subaru finally meets his mother, but is it too late for them? Can Naruto defeat Akahoshi and stop the star from falling back into his hands, and what side will the village choose to take?",
        "rating": "6.2",
        "votes": "496",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "183",
        "title": "The Star's Radiance",
        "air_date": "Wed, May 3, 2006",
        "description": "After Akahoshi tries to execute Sumaru, Hakato and the rest of the children stand up to protect their village. Akahoshi, finding the village turning against him, takes drastic steps to ensure his success. Naruto is the only one left who can take down this menace, can he do it alone? or will he find help from someone more powerful..",
        "rating": "6.1",
        "votes": "500",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "184",
        "title": "Kiba's Long Day!",
        "air_date": "Sat, Aug 2, 2008",
        "description": "When Akamaru is taken ill and starts to undergo a mysterious transformation, can Kiba do anything to save his friend? When the whole village appears to be against him what lengths will he go through, to protect his friend?",
        "rating": "5.8",
        "votes": "498",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "185",
        "title": "A Legend from the Hidden Leaf: The Onbaa!",
        "air_date": "Sat, Aug 2, 2008",
        "description": "While Naruto is training an eagle drops a creature on his back known as an Onbaa. Naruto has to take care of this creature because it won't let go of his back.",
        "rating": "6.0",
        "votes": "503",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "186",
        "title": "Laughing Shino",
        "air_date": "Wed, May 24, 2006",
        "description": "Naruto and Shino are given a mission to provide security during the Kagetsu family funderal, but they soon realize that the real mission is to help the eldest son carry out the man's unusual last will and testment! - This Episode is part of Season 4, Volume 2",
        "rating": "6.1",
        "votes": "523",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "187",
        "title": "Open for Business! The Leaf Moving Service",
        "air_date": "Fri, Aug 8, 2008",
        "description": "Naruto, Hinata, and Chouji are chosen on a mission to protect some peddlers running away from a war at the Greenery Country. However, Tsunade gave them more than just a simple guard duty mission, making them movers as well. The peddlers are just simple folk, who were never even registered citizens in the country. But, when Naruto discovers the group is being pursued, the three ninja realize that there is more going on than meets the eyes.",
        "rating": "5.9",
        "votes": "481",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "188",
        "title": "Mystery of the Targeted Merchants",
        "air_date": "Sat, Aug 9, 2008",
        "description": "The group splits off into two, in an attempt to deter their mysterious attackers. However, when Naruto and Chouji discover the plan hasn't worked as intended, they soon realize that somebody is hiding something important..",
        "rating": "5.8",
        "votes": "482",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "189",
        "title": "A Limitless Supply of Ninja Tools",
        "air_date": "Sat, Aug 16, 2008",
        "description": "Naruto, Chouji, and Yurinojou take on Ruiga, who uses water as a weapon. Ruiga has the power to draw out water from the Earth, giving him an unlimited supply of ninja weapons. How can they defeat an opponent who has a limitless supply of water? Even if they can win, can they defeat the second ninja, Jiga? Also, what is the Princess' true motive for running away?",
        "rating": "6.0",
        "votes": "475",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "190",
        "title": "The Byakugan Sees the Blind Spot",
        "air_date": "Sat, Aug 23, 2008",
        "description": "With Naruto defeated, Hinata decides to join the fight. Will she be able to defeat the second evil ninja? And what of the princess?",
        "rating": "6.5",
        "votes": "483",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "191",
        "title": "Forecast: Death! Cloudy with Chance of Sun",
        "air_date": "Wed, Jun 28, 2006",
        "description": "The battle with the third and final evil ninja is on. He has only one desire and that is to kill Princess Haruna. Will Naruto be able to defeat this new menace and save Haruna?",
        "rating": "5.9",
        "votes": "481",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "192",
        "title": "Ino Screams! Chubby Paradise!",
        "air_date": "Sat, Aug 30, 2008",
        "description": "The princess has gained weight due to nerves and wants Ino to pose as the princess in order to attend the first meeting with a prince she adores. - This Episode is part of Season 4, Volume 3",
        "rating": "5.6",
        "votes": "514",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "193",
        "title": "Viva Dojo Challenge! Youth Is All About Passion!",
        "air_date": "Wed, Jul 12, 2006",
        "description": "When Naruto returns from a mission, he discovers that Lee has set up a Dojo and is desperate for a challenger. When Gai discovers nobody has challenged him he steps up to the plate. However, a last minute change in plans throws changes everything, and when an impostor joins the fray, chaos ensues..",
        "rating": "6.2",
        "votes": "499",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "194",
        "title": "The Mysterious Curse of the Haunted Castle",
        "air_date": "Sat, Sep 6, 2008",
        "description": "Naruto, Hinata, and Kiba are sent to the Land of Honey to search for the Daimyo's wife. There, they find an eerie castle, and journey inside to search for clues.",
        "rating": "5.7",
        "votes": "483",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "195",
        "title": "The Third Super-Beast!",
        "air_date": "Wed, Jul 26, 2006",
        "description": "When Lee misses his check-up with Tsunade, Naruto is sent to find him. Meanwhile Gai is training someone called Yagura and has decided that Lee and Yagura should have a training match. Can Lee beat the new trainee after hearing some uncomfortable news at his examination?",
        "rating": "6.5",
        "votes": "483",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "196",
        "title": "Hot-Blooded Confrontation: Student vs. Sensei",
        "air_date": "Sat, Sep 13, 2008",
        "description": "Gai is trapped inside a fortress made of practice posts. Yagura appears but is he there to help or to hinder? Naruto, Neji and Tenten show up to try and rescue Gai, but will it be too much for them to handle on their own?",
        "rating": "6.6",
        "votes": "488",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "197",
        "title": "Crisis! The Hidden Leaf 11 Gather!",
        "air_date": "Sat, Sep 13, 2008",
        "description": "Naruto meets an old man, a construction worker named Gennou. However, when Gennou steals plans for some of the buildings in Konoha, Naruto suddenly finds himself under investigation by the ANBU. What is the truth behind Gennou and why does nobody seem to know what is going on?",
        "rating": "6.7",
        "votes": "499",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "198",
        "title": "The ANBU Gives Up? Naruto's Recollection",
        "air_date": "Sat, Sep 20, 2008",
        "description": "In order to get the information they need about Gennou, the ANBU put Naruto in a trance, hoping to prong the information they need from Naruto's memory. However, even by doing all of this, will they get the information they need?",
        "rating": "6.9",
        "votes": "499",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "199",
        "title": "The Missed Target",
        "air_date": "Sat, Sep 20, 2008",
        "description": "Naruto and the others continue their search for any clues leading to Gennou or his plan. During an investigation of the Ninja Academy, they discover a suspicious training post which leads to an even scarier discovery.",
        "rating": "7.1",
        "votes": "509",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "200",
        "title": "The Powerful Helper",
        "air_date": "Sat, Oct 4, 2008",
        "description": "With the city of Konoha mapped in explosive tags, a decision must be made weather to try and remove them, or to evacuate the entire city. However, something is strange about these tags, can they discover what it is? And can they remove all of them in time?",
        "rating": "7.0",
        "votes": "511",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "201",
        "title": "Multiple Traps! Countdown to Destruction",
        "air_date": "Wed, Sep 20, 2006",
        "description": "While Shikamaru tries to figure out what Gennou is planning next, Naruto is fighting Gennou in the Great Stone faces. Can Shikamaru stop Gennou's next step in the plan before it is too late? And will Naruto be able to defeat the Trap Master?",
        "rating": "7.4",
        "votes": "530",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "202",
        "title": "The Top 5 Ninja Battles",
        "air_date": "Wed, Sep 27, 2006",
        "description": "Naruto and Sakura host a special recap episode featuring the top five battles so far. There are also interviews with some of the team, and perhaps even some of the enemy..",
        "rating": "4.8",
        "votes": "508",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "203",
        "title": "Kurenai's Decision, Squad 8 Left Behind",
        "air_date": "Thu, Oct 5, 2006",
        "description": "Naruto encounters a girl named Yakumo who has a surprising talent for destruction. Shortly after, Kurenai Yuhi, leader of Team 8 makes a startling decision and Naruto is determined to find out why.",
        "rating": "6.3",
        "votes": "475",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "204",
        "title": "Yakumo's Sealed Ability",
        "air_date": "Thu, Oct 5, 2006",
        "description": "Naruto sneaks into Yakumo's mansion in the night, and has a dream that Kurenai threatened to seal Yakumo's abilities. He then discovers that this is the reason why she left the team, but Kurenai refuses to disclose any more. As Kurenai goes to see Yakumo, several Kurama Clan members attack.",
        "rating": "6.4",
        "votes": "479",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "205",
        "title": "Kurenai's Top-Secret Mission: The Promise With the Third Hokage",
        "air_date": "Thu, Oct 5, 2006",
        "description": "As Kurenai attempts to escape with Yakumo, Naruto and Sakura, Team 8 and Might Gai arrive to lend their assistance. We learn some of the history between Kurenai and Yakumo and discover why things have turned out the way they have.",
        "rating": "6.5",
        "votes": "475",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "206",
        "title": "Genjutsu or Reality?",
        "air_date": "Thu, Oct 19, 2006",
        "description": "Naruto, Kurenai, Yakumo and Team 8 return to Konoha to a shocking discovery. Can this really be reality or is it all some kind of sick illusion?",
        "rating": "6.6",
        "votes": "478",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "207",
        "title": "The Supposed Sealed Ability",
        "air_date": "Tue, Sep 26, 2006",
        "description": "Naruto and the members of Team 8 head into Yakumo's house to find her with Kurenai. It is revealed that a mysterious entity might be behind all this. Can the group discover the truth in time?",
        "rating": "6.7",
        "votes": "487",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "208",
        "title": "The Weight of the Prized Artifact!",
        "air_date": "Thu, Nov 2, 2006",
        "description": "Naruto and Kiba are ordered to escort a man named Shinemon who is transporting a rare and valuable artifact. However, when Bandits steal the artifact, can the pair retrieve it and keep Shinemon alive?",
        "rating": "5.4",
        "votes": "491",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "209",
        "title": "The Enemy: Ninja Dropouts",
        "air_date": "Thu, Nov 9, 2006",
        "description": "Naruto, Sakura and Lee are sent to escort a prisoner named Gantetsu to the Forest Country Capital. Their job is only to back up the escort group in case something goes wrong, which inevitably, it does..",
        "rating": "5.9",
        "votes": "474",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "210",
        "title": "The Bewildering Forest",
        "air_date": "Thu, Nov 16, 2006",
        "description": "With the ship split in half, Naruto, Todoroki and Gantetsu are separated from the others. Now Naruto must face the other three Shinobazu that Gantetsu was with. Can Naruto lead them out or will they have to trust Gantetsu to lead the way?",
        "rating": "6.2",
        "votes": "475",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "211",
        "title": "Memory of Flames",
        "air_date": "Thu, Nov 30, 2006",
        "description": "Todoroki wants to avenge his family and kill Gantetsu. The only problem is that Naruto has other ideas. Elsewhere, Lee and Sakura are surrounded by children who are demanding they give them Gantetsu. Can Naruto and Todoroki get Gantetsu back? And what are the children's reasons for wanting him?",
        "rating": "6.1",
        "votes": "472",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "212",
        "title": "To Each His Own Path",
        "air_date": "Thu, Dec 7, 2006",
        "description": "Naruto arrives to save Gantetsu and the kids but has trouble when Akio is kidnapped and Todoroki realizes his brother is alive. Will Naruto and Todoroki be able to save Akio?",
        "rating": "6.2",
        "votes": "475",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "213",
        "title": "Vanished Memories",
        "air_date": "Thu, Dec 14, 2006",
        "description": "Naruto rescues a kid who was injured but he is an outsider to Konoha. Tsunade assigns Naruto to take care of the kid until he gets his memory back. What was this kid doing outside of Konoha and why can't he remember anything?",
        "rating": "6.4",
        "votes": "491",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "214",
        "title": "Bringing Back Reality",
        "air_date": "Thu, Dec 21, 2006",
        "description": "Naruto and Menma manage to get Tsunade to let them go find Menma's memories. However, they are forced to go with Neji and Tenten guarding them. On the way, they come across a burned-down village. There, they greet the villagers and ask them what happened. Unfortunately, the villagers aren't too happy to see them.",
        "rating": "6.3",
        "votes": "492",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "215",
        "title": "A Past to Be Erased",
        "air_date": "Thu, Dec 21, 2006",
        "description": "Ran wants to kill Menma, upon seeing the mark on his arm, but Neji stands in the way, saying it would be unfair to kill a criminal without any memories of his crimes. Ran finally agrees and performs surgery on Menma, saving his life, but the villagers aren't as happy. Are they prepared for when foreign shinobi group comes for a second attack?",
        "rating": "6.8",
        "votes": "520",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "216",
        "title": "The Targeted Shukaku",
        "air_date": "Thu, Jan 11, 2007",
        "description": "A Sand shinobi, Matsuri, has been abducted by a mysterious ninja. In order to bring them bring back, Gaara must accept the mystery ninja's challenge. Can Naruto prevent this challenge ending in catastrophe?",
        "rating": "7.2",
        "votes": "549",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "217",
        "title": "Sand Alliance with the Leaf Shinobi",
        "air_date": "Thu, Jan 18, 2007",
        "description": "The rogue ninjas continue running as Gaara, Temari and Kankuro give chase. At the same time, Shino, Hinata and Neji are using their abilities to try and find the Shitenshounnin. Who will end up fighting first and, who will ultimately win?",
        "rating": "7.3",
        "votes": "540",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "218",
        "title": "The Counterattack!",
        "air_date": "Thu, Jan 25, 2007",
        "description": "Shikamaru and Ino arrive to help out Temari against Kyaku, while Kiba and Chouji go to help Konkuro. All seems to be going well until Neji notices something odd.",
        "rating": "7.4",
        "votes": "541",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "219",
        "title": "The Ultimate Weapon Reborn",
        "air_date": "Thu, Feb 1, 2007",
        "description": "Although his comrades are defeated, Jin puts his final plan in motion by using Gaara to revive Seimei. To do this, he traps Gaara in a metal sphere that starts draining his chakra. Gaara partially transforms into the One-Tailed Shukaku--which is what Jin wanted all along. Jin then performs a ritual and sacrifices his own body to Seimei's corpse, which allows Seimei to be reincarnated. Seimei then takes up the weapons of the Shitenshonin, therefore becoming the \"ultimate weapon\" of Takumi Village. Naruto does battle with him until Gaara bursts out of the metal sphere, partially transformed into the One-Tailed Shukaku.",
        "rating": "7.2",
        "votes": "553",
        "type": "Filler"
    },
    {
        "season": "1",
        "episode": "220",
        "title": "Departure",
        "air_date": "Thu, Feb 8, 2007",
        "description": "Naruto recovers from his latest battle and Jiraiya takes him on a journey to begin his training away from Konohagukre.",
        "rating": "8.0",
        "votes": "889",
        "type": "Mixed Canon/Filler"
    }
]
